ХамелионЦРПТ/src/InformationRegisters/МВ_ДополнительныеНастройки/МВ_ДополнительныеНастройки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>МВ_ДополнительныеНастройки</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Значение</name>
    <type>
      <types>Characteristic.МВ_ПереченьДополнительныхНастроек</types>
    </type>
  </resources>
  <dimensions>
    <name>Настройка</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.МВ_ПереченьДополнительныхНастроек</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации_ХамелеонЦРПТ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ХамелионЦРПТ/src/ChartsOfCharacteristicTypes/МВ_ПереченьДополнительныхНастроек/МВ_ПереченьДополнительныхНастроек.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>МВ_ПереченьДополнительныхНастроек</name>
  <type>
    <types>Boolean</types>
    <types>CatalogRef.Пользователи_ХамелеонЦРПТ</types>
    <types>String</types>
    <types>Date</types>
    <types>Number</types>
    <types>CatalogRef.Продукция_ХамелеонЦРПТ</types>
    <types>CatalogRef.Организации_ХамелеонЦРПТ</types>
    <numberQualifiers>
      <precision>15</precision>
      <scale>3</scale>
    </numberQualifiers>
    <stringQualifiers>
      <length>1024</length>
    </stringQualifiers>
  </type>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>РаботаСОператоромОКТО</name>
      <description>Работа с оператором ОКТО</description>
    </items>
    <items>
      <name>КаталогЧтенияВСД</name>
      <description>Каталог чтения ВСД</description>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </items>
    <items>
      <name>ОсновнаяОрганизация</name>
      <description>Основная организация</description>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>CatalogRef.Организации_ХамелеонЦРПТ</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </items>
    <items>
      <name>ОсновнойПоставщик</name>
      <description>Основной поставщик</description>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </items>
    <items>
      <name>ЭтоЦентральнаяБаза</name>
      <description>Это центральная база</description>
      <type>
        <types>Boolean</types>
      </type>
    </items>
  </predefined>
  <attributes>
    <name>Общая</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеПоУмолчанию</name>
    <type>
      <types>Characteristic.МВ_ПереченьДополнительныхНастроек</types>
    </type>
  </attributes>
  <attributes>
    <name>Порядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:ChartOfCharacteristicTypes>

ХамелионЦРПТ/src/InformationRegisters/МВ_ДополнительныеНастройки/Forms/ФормаЗаписиИстории/Module.bsl
// ФТО:ALNA 07.08.2019 30701

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьЗначенияСвойств(Запись, Параметры.ЗначенияЗаполнения);	
	Элементы.Значение.ОграничениеТипа = Запись.Настройка.ТипЗначения;
	Запись.Значение = Элементы.Значение.ОграничениеТипа.ПривестиЗначение(Запись.Значение);
	
	Заголовок = "" + Запись.Настройка + ?(ЗначениеЗаполнено(Запись.Организация), " (" + Запись.Организация + ")", " (общая)"); 
	
	//++ ФТО:ALNA 15.08.2019 31209
	ДиалогВыбораФайла = "";
	ПВХ = ПланыВидовХарактеристик.МВ_ПереченьДополнительныхНастроек;
		
	Если Запись.Настройка = ПВХ.КаталогЧтенияВСД Тогда	
		//-- ФТО:SOAL 12.03.2020 
		Элементы.Значение.КнопкаВыбора = Истина;
		ДиалогВыбораФайла = "КАТАЛОГ";
	//++ ФТО:ALNA 23.08.2019 31369
	ИначеЕсли Запись.Настройка = "КаталогОбмена" Тогда
			Элементы.Значение.ВыборГруппИЭлементов = ГруппыИЭлементы.Группы;
	//-- ФТО:ALNA 23.08.2019	
	//++ ФТО:SOAL 03.10.2019 32239
	ИначеЕсли РегистрыСведений.МВ_ДополнительныеНастройки.ВключатьРежимПароляДляНастройки(Запись.Настройка) Тогда
		Элементы.Значение.РежимПароля = Истина;
	//-- ФТО:SOAL 03.10.2019 	
	//++ ФТО:KOLT 14.10.2019 32652
	ИначеЕсли Запись.Настройка = "ПВХ.СкладОбеспеченияДляТранзита" Тогда
		Элементы.Значение.ВыборГруппИЭлементов = ГруппыИЭлементы.Элементы;
	//-- ФТО:KOLT 14.10.2019
	//++ ФТО:ALNA 16.10.2019 30701
	ИначеЕсли Запись.Настройка = "ПВХ.ОсновнойПоставщик" Тогда
		ПараметрыВыбора = Новый Массив;
		ПараметрыВыбора.Добавить(Новый ПараметрВыбора("Отбор.Поставщик", Истина));
		НовыеПараметры = Новый ФиксированныйМассив(ПараметрыВыбора);
		Элементы.Значение.ПараметрыВыбора = НовыеПараметры;
	//-- ФТО:ALNA 16.10.2019
	КонецЕсли;	
	//-- ФТО:ALNA 15.08.2019
		
КонецПроцедуры
	
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("МВ_ДополнительныеНастройки.ИзменениеНастроек");

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//++ ФТО:ALNA 15.08.2019 31209
&НаКлиенте
Процедура ЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если ДиалогВыбораФайла = "КАТАЛОГ" Тогда	
		СтандартнаяОбработка = Ложь;
		
		Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
		Диалог.Каталог = Запись.Значение;
		ФайловаяСистемаКлиент.ПоказатьДиалогВыбора(Новый ОписаниеОповещения("ДиалогВыбораФайлаЗавершение", ЭтаФорма), Диалог);		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДиалогВыбораФайлаЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеФайлы <> Неопределено И ВыбранныеФайлы.Количество() > 0 Тогда
		Запись.Значение = ВыбранныеФайлы[0] + "\";
	КонецЕсли;
	
КонецПроцедуры
//-- ФТО:ALNA 15.08.2019

#КонецОбласти
